Repository: HenestrosaConH/github-users
Catalog: Source/GitHubUsers/Resources/Strings/*.lproj/Localizable.strings
Languages: es

# title_generic_error
source: Something went wrong
es: Algo fue mal

source: Favorites
es: Favoritos

source: Followers
es: Seguidores

source: Following
es: Seguidos

# repos
source: Repositories
es: Repositorios

source: Search
es: Buscar

# title_no_followers
source: No followers
es: No hay seguidores

# title_no_followings
source: No followings
es: No hay seguidos

# description_generic_network_error
source: Unable to complete your request. Please check your Internet connection.
es: No se ha podido completar tu acción. Por favor, revisa tu conexión de Internet.

# description_invalid_response
source: Invalid response from the server. Please try again.
es: Respuesta inválida del servidor. Por favor, inténtalo de nuevo.

# description_invalid_data
source: The data received from the server was invalid. Please try again.
es: Los datos obtenidos no son válidos. Por favor, inténtalo de nuevo.

# description_unauthorized
source: This resource cannot be accessed.
es: No se puede acceder a este recurso.

# description_unexpected_status_code
source: Unexpected error when executing the network call.
es: Error inesperado al ejecutar la acción.

# description_no_response
source: No response retrieved from the server. Please try again.
es: No hay respuesta del servidor. Por favor, inténtalo de nuevo.

# description_no_followers
source: This user has no followers.
es: Este usuario no tiene seguidores.

# description_no_followings
source: This user doesn't follow anyone.
es: Este usuario no sigue a nadie.

# description_unable_to_favorite
source: There was an error favoriting this user. Please try again.
es: No se ha podido añadir el usuario a favoritos. Por favor, inténtalo de nuevo.

# description_unable_to_remove
source: There was an error removing this user from favourites. Please try again.
es: No se ha podido eliminar al usuario de favoritos. Por favor, inténtalo de nuevo.

# description_unable_to_get_favorites
source: There was an error getting the favorite users. Please try again.
es: No se han podido obtener los usuarios favoritos. Por favor, inténtalo de nuevo.

# FavoritesListViewController.empty_state
source: No favorites? Search for a user and add it!
es: ¿Aún no tienes favoritos? ¡Busca a un usuario y añádelo!

# UserInfoViewController.github_profile
source: GitHub profile
es: Perfil de GitHub

# UserInfoViewController.github_user_since
source: GitHub user since
es: Usuario de GitHub desde

# UsersListViewController.search_placeholder
source: Search for a username
es: Filtrar por nombre…

# SearchViewController.placeholder
source: Enter a username
es: Introduce usuario

# SearchViewController.get_user
source: Get user
es: Obtener usuario

# SearchViewController.title_empty_username
source: Empty username
es: Nombre de usuario vacío

# SearchViewController.description_empty_username
source: Please enter a username.
es: Introduce un nombre de usuario.
